Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TooManyElementsToCheckout
Too many elements were attempted to be marked as editable, prompt user to mark workset(s) editable instead

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.RPCTurnOffInRealisticWarn
None of the placed RPC elements are visible when the visual style is set to Realistic. To see the elements, change VisualStyle of the current view, or change RPC visibility in Graphic Display Options.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PlacementFailed
Failed to place component.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ExtendToOthersWarn
Can't keep [Type Name] extended to [Type Name].